In [20]:
print('''
7. Consider the following data frame containing a family name, gender of the family member and her/his monthly
income in each record.
FamilyName Gender MonthlyIncome_(Rs.)
Shah Male 44000.00
Vats Male 65000.00
Vats Female 43150.00
Kumar Female 66500.00
Vats Female 255000.00
Kumar Male 103000.00
Shah Male 55000.00
Shah Female 112400.00
Kumar Female 81030.00
Vats Male 71900.00
Write a program in Python using Pandas to perform the following:
      
a. Calculate and display familywise gross monthly income.
b. Display the highest and lowest monthly income for each family name
c. Calculate and display monthly income of all members earning income less than Rs. 80000.00.
d. Display total number of females along with their average monthly income
e. Delete rows with Monthly income less than the average income of all members
''')

7. Consider the following data frame containing a family name, gender of the family member and her/his monthly
income in each record.
FamilyName Gender MonthlyIncome_(Rs.)
Shah Male 44000.00
Vats Male 65000.00
Vats Female 43150.00
Kumar Female 66500.00
Vats Female 255000.00
Kumar Male 103000.00
Shah Male 55000.00
Shah Female 112400.00
Kumar Female 81030.00
Vats Male 71900.00
Write a program in Python using Pandas to perform the following:

a. Calculate and display familywise gross monthly income.
b. Display the highest and lowest monthly income for each family name
c. Calculate and display monthly income of all members earning income less than Rs. 80000.00.
d. Display total number of females along with their average monthly income
e. Delete rows with Monthly income less than the average income of all members

In [21]:
import pandas as pd

df = pd.read_csv("data_frame.csv",delimiter=" ")
df

  FamilyName  Gender  MonthlyIncome_(Rs.)
0       Shah    Male              44000.0
1       Vats    Male              65000.0
2       Vats  Female              43150.0
3      Kumar  Female              66500.0
4       Vats  Female             255000.0
5      Kumar    Male             103000.0
6       Shah    Male              55000.0
7       Shah  Female             112400.0
8      Kumar  Female              81030.0
9       Vats    Male              71900.0

In [45]:
#a. Calculate and display familywise gross monthly income.
print(df)
families = df.groupby("FamilyName")
# f=df(column=["FamilyName","Gender"])
df["MonthlyIncome_(Rs.)"]

  FamilyName  Gender  MonthlyIncome_(Rs.)
0       Shah    Male              44000.0
1       Vats    Male              65000.0
2       Vats  Female              43150.0
3      Kumar  Female              66500.0
4       Vats  Female             255000.0
5      Kumar    Male             103000.0
6       Shah    Male              55000.0
7       Shah  Female             112400.0
8      Kumar  Female              81030.0
9       Vats    Male              71900.0

0     44000.0
1     65000.0
2     43150.0
3     66500.0
4    255000.0
5    103000.0
6     55000.0
7    112400.0
8     81030.0
9     71900.0
Name: MonthlyIncome_(Rs.), dtype: float64